#ატრიბუტი  არის თვისება ან თვისება, რომელიც მიანიჭებს ელემენტს (მაგალითად, HTML-ის ელემენტს) დამატებით ინფორმაციას. 
# ატრიბუტი შეადგენს ელემენტის დეფინიციას და აღწერს მის მდგომარეობას ან მოქმედებას.
#  მაგალითად, HTML-ში, <img> ტეგის ატრიბუტი src აღწერს იმ სურათის მისამართს, რომელიც უნდა ჩაიწეროს.#Optional ატრიბუტი არის ატრიბუტი, რომლის დამატება არ არის სავალდებულო.
#  ანუ, თუ ის არ არის მითითებული, ის არ იმოქმედებს ელემენტის ფუნქციონირებაზე და ელემენტი მაინც შეიძლება მუშაობდეს.
# #Required ატრიბუტი არის ატრიბუტი, რომლის მითითება აუცილებელია, რათა ელემენტი სწორად იმუშაოს. თუ required ატრიბუტი არ არის მითითებული, ელემენტი ვერ იქნება ვალიდური ან არ იმუშავებს.


